## Brewfile

# Taps
tap 'Homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'sambadevi/powerlevel9k'

# Basics
brew 'ack'
brew 'awscli'
brew 'ctop'
brew 'docker'
brew 'freetds'
brew 'gifsicle'
brew 'htop'
brew 'httpie'
brew 'mysql'
brew 'postgresql'
brew 'powerlevel9k'
brew 'wget'
cask 'java'
brew 'scala'

# Programming
# brew 'apache-spark'
brew 'jq'
brew 'npm'
brew 'R'
brew 'rbenv'
brew 'python3'
brew 'tmux'
brew 'scalastyle'
brew 'sbt'
brew 'yarn'

## Caskfile
cask '1password'
cask 'alfred'
cask 'atom'
cask 'chrome-devtools'
cask 'jing'
cask 'ngrok'
cask 'flash-player'
cask 'flux'
cask 'iterm2'
cask 'rstudio'
cask 'spectacle'
cask 'spotify'
cask 'vlc'

# Fonts
cask 'font-droidsansmono-nerd-font'
cask 'font-droidsansmono-nerd-font-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-hack-nerd-font'
