## Brewfile

# Taps
tap 'Homebrew/bundle'
tap 'caskroom/fonts'
tap 'sambadevi/powerlevel9k'

# Basics
brew 'ack'
brew 'ctop'
brew 'docker'
brew 'htop'
brew 'httpie'
brew 'postgresql'
brew 'powerlevel9k'
brew 'wget'

# Programming
# brew 'git'
brew 'jq'
brew 'rbenv'
brew 'python2'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'

## Caskfile
cask '1password'
cask 'alfred'
cask 'atom'
cask 'chrome-devtools'
# cask 'dropbox'
# cask 'google-chrome'
cask 'java'
cask 'ngrok'
cask 'flash-player'
cask 'flux'
cask 'iterm2'
# cask 'slack' #  - use App Store
cask 'spectacle'
cask 'spotify'
cask 'vlc'

# Fonts
cask 'font-droidsansmono-nerd-font'
cask 'font-droidsansmono-nerd-font-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-hack-nerd-font'
